<?php
/* Завдання 
$name = "iphone ";
$price = 31333;
Скидка на товар 20%
Доставка товару 500 грн.
    Вивести на екран:
    Назву товару
    ціну товару 
    ціну товару зі знижкою
    ціну товару зі знижкою та доставкою
    */


$name = "iphone ";
$price = 31333;
$discount = 20;
$delivery = 500;
echo "Назва товару: $name <br>";
echo "Ціна товару: $price <br>";
echo "Ціна товару зі знижкою: " . $price * (100 - $discount) / 100 . "<br>";
echo "Ціна товару зі знижкою та доставкою: " . ($price * (100 - $discount) / 100 + $delivery) . "<br>";
 /* 


 echo "Назва товару: $name "<br>";
 echo "Ціна товару: $prise <br>";
 echo "Ціна товару зі знижкою:" . $prise * (100 - $discount) / 100 . "<br>";
 echo "Ціна товару зі знижкою та доставкою:" . (prise * (100 - $discount) / 100 + delivery) . "<br>";
    */
    
