<?php

// так виглядає однорядковий коментарій 
/* ось так виглядає
    багато рядковий коментарій */


$userName;                  // Camel case, зміні з великою буквою та маленькою будуть відрізнятися одне від одного 
$suer_name;                 // Snake case, регістр чутливий до великих та малих символах 

$name = "Jack";             // рядок
$centry=20;                 // число, якщо поставити "" то це буде рахуватися як рядок
echo $name, "<br>";                 // Виведе на екран зміну Jack, тобто зміну $name = "Jack"
echo 'hello world! <br>';   //  тег <br> відповідає за розділення тексту по рядках
//                          echo 'hello $name <br>'; зміна не буде виконуватися в одинарних кавичках
echo "Hello $name <br>";     // якщо потрібно і рядок і зміні то використовуємо подвійні кавички ""
echo 'Сума чисел: 3 + 2 = '. 3+2 . "<br>"; // це виведеться як текст: 'Сума чисел: 3 + 2 = ' // . 3+2 . так виокнується дія сума тд.
echo "$name was born in the {$centry} th centry <br>"; // 20 століття для того щоб вивести зміну в продовженні з текстом потрібні фігурні дужки {}

$centry=30;
echo "name - ", $name, " centry -  {$centry} th", "<br>"; // 30 століття, змінні можна мінняти безліч разів вони будуть виводитися в записаному порядку

?>

<?php


echo "company 'Blizzard Entertaiment' <br>";
echo 'company "Blizzard Entertaiment" <br>';
echo "company \"Blizard Entertaiment\" \$nam<br>";

?>

<div>                                                               <!-- div це функція яка створює блок, блочний елемент  -->
    <span> Текущая дата: <?= date('d.m.Y H:i:s') ?> </span>    <!-- date функція для динамічної зміни дати на веб сторінці date('d.m.Y H:i:s') = date (день.місяць.Рік Години:хвилилни:секунди) -->
</div>                                                              <!-- span являється строчним елементом -->

<?php

// Константа - зберігає значення, але в відміності від змінної це значення може бути заданим лише 1 раз!.
// define ("Назва, значення") / тобто назва константи, і значення чому буде дорівнюватиме константа 
// Константи пишуться з великих букв / знак склеювання рядка " . " крапочка
define("DB_LOGIN", "root");
echo DB_LOGIN . "<br>";


define('COLORS', [0 =>'red', 1=>'green', 2=>'blue']);                     // в константи можна вбудовувати масиви
//                                                               Насправді масив PHP - це впорядковане відображення, яке встановлює відповідність між значенням і ключем.
echo COLORS[4] . "<br>";
echo defined('COLORS') . "<br>";




// Вбудованні константи 

echo __DIR__, "<br>";                  // шлях до декрикторії папоки де знаходиться файл        F:\OSPanel\domains\DarcProgers
echo __FILE__, "<br>";                 // шлях до прямого файлу                                 F:\OSPanel\domains\DarcProgers\index.php
echo __LINE__, "<br>";                 // Константа __LINE__ в мові програмування PHP повертає номер поточного рядка коду, в якому вона була використана.
echo PHP_VERSION, "<br>";              // показує поточну версію встановленого PHP
error_reporting(E_ALL);                // показує усі помилки написаного раніше коду в звіт

?>