<?php 
// Умови

// Конструкція усмови if else 

/*
if (10>3) {
    // виконується, якщо умова true
 } 
else
 {
    // виконується, якщо умова false
}

// Конструкція усмови if else   
if(умова){
    дія
} else {
   дія
}



$rain = 1; // 1 - іде дощ, 0 - погода ясна
if($rain ) {
    echo "іде дощ <br>";
    if($rain>3) echo "Сильний дощ <br>";
} else {
    echo"погода ясна <br>";
}

echo $rain ? "Іде дощ <br>" : "Погода ясна <br>"; // тернарний оператор, скорочений запис if else





// Else if

$price = 100;

if($price >= 100){ // якщо ціна більша або дорівнює 100, тоді виводимо на екран "Скидка 30%"
    echo "Скидка 30% <br>";
}
elseif ($price >= 50){ // якщо ціна більша або дорівнює 50, тоді виводимо на екран "Скидка 15%"
    echo "Скидка 15% <br>";
}
else {
    echo "Скидка 10% <br>"; // якщо ціна менша 50, тоді виводимо на екран "Скидка 10%"
}

//$discount = $price >= 100 ? 30 : ($price >= 50 ? 15 : 10); // тернарний оператор,  if else
$discount = $price >= 100 ? 30 : 10; // тернарний оператор, скорочений запис if else
echo "Скидка $discount % <br>";

$x = 5;
$y = 15;
if($x >5 || $y > 10) //  || якщо два значення false тоді код не виконується
echo $x+$y. "<br>";
$t = 18;
$z = 15;
if($t >5 && $z > 10) //  && якщо одне значення false тоді код не виконується 
echo $t+$z ."<br>";



 ISSET - вичначає Функція isset()
Визначає, чи встановлена ​​змінна, і чи не має вона значення NULL .
Якщо змінна була скинута (вилучена) з допомогою функції unset() , така змінна більше не буде встановлена. 
Функція isset() при тестуванні (перевірці) змінної поверне FALSE , якщо для неї встановлено значення NULL .


$user = 'dark';
if(isset($user)) ;
    echo "Привіт, $user <br>";
    unset($user); // видаляємо змінну
    //  echo "Привіт, $user <br>"; // помилка, тому що змінна видалена



//Empty - вичначає чи змінна пуста - "", false, "0",0, null
//$_SESSION['user'] = 'dark';

$user = $_SESSION['user']??0; // якщо змінна пуста, тоді виводимо 0, або "Гость"

if(empty($user)){
    echo"Гость";
}else echo "$user"; 
*/

// SWTCH - Switch statement), також знана як інструкція вибору та оператор перемикач (switch, case, select або inspect) — це спеціального виду інструкція мови програмування, що забезпечує багатонаправлене (множинне) розгалуження у програмі.


$lang = $_GET['lang']??"ua";

switch($lang) {
    case 'en':
        echo 'Hello world';
    break; // break - виходить з умови обовязково в кінці ;
    case 'de':
        echo 'Hallo welt';
    break;
    case 'ua':
        case 'Українська':
        echo 'Привіт світ';
    break;
    default: // це якщо ні одна з умов не виконується
        echo 'Дана мова не підтримується ';
    break;
}

?>
<div>
    <a href="?lang=ua">Українська</a>
    <a href="?lang=en">Англіська<</a>
    <a href="?lang=de">Німецька</a> 
</div>
