<?php
// Оператори в PHP

// Арифметичні оператори

$x = 5;
$y = 2;
echo $x + $y . "<br>"; // додавання
echo $x - $y . "<br>";// віднімання
echo $x * $y . "<br>";// множення
echo $x / $y . "<br>";// ділення
echo $x % $y . "<br>";// остача від ділення
echo $x ** $y . "<br>";// піднесення до степеня
echo  25 **(1/2) . "<br>";// корінь квадратний з числа 25
$a  = "Hello";
$b = "World";
echo $a . $b . "<br>"; // конкатенація

//Пріоритети операторів
echo 3+ 3 * 3 . "<br>"; // 12
echo (3+ 3) * 3 . "<br>"; // 18
echo 2/2 * 2 . "<br>"; // 2
echo 10>3+8 . "<br>"; // 
 

// Оператор присвоєння
 $z = 10;
 $z = $z + 2 ;
    $z += 2; 
    $z -= 2; 
    $z *= 2; 
    $z /= 2; 
$z   .= '      $';
    echo $z . "<br>";
// інкремент і декремент

$x = 10;
$x --;
$x++; // $x = $x + 1;
echo $x, "<br>";
$var = 5;
echo ++$var,"<br>"; // 6
$var2 = 5 ;
echo $var2++ , "<br>"; // 
echo $var2, "<br>"; // 6


$str ="A";
echo ++$str, "<br>"; // B якщо використовуємо ++ то виводиться наступний символ в алфавіті


// Оператори порівняння
$x = 10;
$y = 5;
echo $x > $y, "<br>"; 
echo $x < $y, "<br>";


$a = 33; // int
$b = "33"; // string
echo ($a === $b), "<br>"; // true
echo ($a !== $b), "<br>"; 


$c = true;
$d = false;

echo !$d, "<br>";
echo $c && $d, "<br>"; //
echo $c || $d, "<br>"; // 1*10
echo $c xor $d, "<br>"; 


echo (!$c || $d ) && ($c xor $a);




?>